/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl<T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __IncompleteArrayField<T> {}
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]

pub const VM_VOLATILE_MAKE_LAST_IN_GROUP: ::std::os::raw::c_uint = 0;
pub const VM_PURGABLE_STATE_MIN: ::std::os::raw::c_uint = 0;
pub const VM_PURGABLE_STATE_MAX: ::std::os::raw::c_uint = 3;
pub const VM_PURGABLE_STATE_MASK: ::std::os::raw::c_uint = 3;
pub const VM_PURGABLE_NONVOLATILE: ::std::os::raw::c_uint = 0;
pub const VM_PURGABLE_VOLATILE: ::std::os::raw::c_uint = 1;
pub const VM_PURGABLE_EMPTY: ::std::os::raw::c_uint = 2;
pub const VM_PURGABLE_DENY: ::std::os::raw::c_uint = 3;
pub const VM_PURGABLE_ALL_MASKS: ::std::os::raw::c_uint = 79731;
pub const VM_REGION_INFO_MAX: ::std::os::raw::c_uint = 1024;
pub const VM_REGION_BASIC_INFO_64: ::std::os::raw::c_uint = 9;
pub const VM_REGION_BASIC_INFO: ::std::os::raw::c_uint = 10;
pub const SM_COW: ::std::os::raw::c_uint = 1;
pub const SM_PRIVATE: ::std::os::raw::c_uint = 2;
pub const SM_EMPTY: ::std::os::raw::c_uint = 3;
pub const SM_SHARED: ::std::os::raw::c_uint = 4;
pub const SM_TRUESHARED: ::std::os::raw::c_uint = 5;
pub const SM_PRIVATE_ALIASED: ::std::os::raw::c_uint = 6;
pub const SM_SHARED_ALIASED: ::std::os::raw::c_uint = 7;
pub const SM_LARGE_PAGE: ::std::os::raw::c_uint = 8;
pub const VM_REGION_EXTENDED_INFO: ::std::os::raw::c_uint = 13;
pub const VM_REGION_TOP_INFO: ::std::os::raw::c_uint = 12;
pub const VM_MAP_ENTRY_MAX: ::std::os::raw::c_uint = 256;
pub const VM_PAGE_INFO_BASIC: ::std::os::raw::c_uint = 1;
pub const KMOD_MAX_NAME: ::std::os::raw::c_uint = 64;
pub const KMOD_RETURN_SUCCESS: ::std::os::raw::c_uint = 0;
pub const KMOD_RETURN_FAILURE: ::std::os::raw::c_uint = 5;
pub const KMOD_INFO_VERSION: ::std::os::raw::c_uint = 1;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __mbstate_t {
    pub __mbstate8: __BindgenUnionField<[::std::os::raw::c_char; 128usize]>,
    pub _mbstateL: __BindgenUnionField<::std::os::raw::c_longlong>,
    pub bindgen_union_field: [u64; 16usize],
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::std::mem::size_of::<__mbstate_t>(),
               128usize,
               concat!("Size of: ", stringify!(__mbstate_t)));
    assert_eq!(::std::mem::align_of::<__mbstate_t>(),
               8usize,
               concat!("Alignment of ", stringify!(__mbstate_t)));
    assert_eq!(unsafe { &(*(0 as *const __mbstate_t)).__mbstate8 as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__mbstate_t),
                       "::",
                       stringify!(__mbstate8)));
    assert_eq!(unsafe { &(*(0 as *const __mbstate_t))._mbstateL as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__mbstate_t),
                       "::",
                       stringify!(_mbstateL)));
}
impl Clone for __mbstate_t {
    fn clone(&self) -> Self {
        *self
    }
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    assert_eq!(::std::mem::size_of::<__darwin_pthread_handler_rec>(),
               24usize,
               concat!("Size of: ", stringify!(__darwin_pthread_handler_rec)));
    assert_eq!(::std::mem::align_of::<__darwin_pthread_handler_rec>(),
               8usize,
               concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_pthread_handler_rec)).__routine as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_pthread_handler_rec),
                       "::",
                       stringify!(__routine)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_pthread_handler_rec)).__arg as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_pthread_handler_rec),
                       "::",
                       stringify!(__arg)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_pthread_handler_rec)).__next as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_pthread_handler_rec),
                       "::",
                       stringify!(__next)));
}
impl Clone for __darwin_pthread_handler_rec {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_attr_t>(),
               64usize,
               concat!("Size of: ", stringify!(_opaque_pthread_attr_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_attr_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_attr_t)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_attr_t)).__sig as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_attr_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_attr_t)).__opaque as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_attr_t),
                       "::",
                       stringify!(__opaque)));
}
#[repr(C)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_cond_t>(),
               48usize,
               concat!("Size of: ", stringify!(_opaque_pthread_cond_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_cond_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_cond_t)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_cond_t)).__sig as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_cond_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_cond_t)).__opaque as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_cond_t),
                       "::",
                       stringify!(__opaque)));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_condattr_t>(),
               16usize,
               concat!("Size of: ", stringify!(_opaque_pthread_condattr_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_condattr_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_condattr_t)).__sig as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_condattr_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe {
                   &(*(0 as *const _opaque_pthread_condattr_t)).__opaque as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_condattr_t),
                       "::",
                       stringify!(__opaque)));
}
impl Clone for _opaque_pthread_condattr_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_mutex_t>(),
               64usize,
               concat!("Size of: ", stringify!(_opaque_pthread_mutex_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_mutex_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_mutex_t)).__sig as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_mutex_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_mutex_t)).__opaque as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_mutex_t),
                       "::",
                       stringify!(__opaque)));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
               16usize,
               concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_mutexattr_t)).__sig as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_mutexattr_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe {
                   &(*(0 as *const _opaque_pthread_mutexattr_t)).__opaque as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_mutexattr_t),
                       "::",
                       stringify!(__opaque)));
}
impl Clone for _opaque_pthread_mutexattr_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_once_t>(),
               16usize,
               concat!("Size of: ", stringify!(_opaque_pthread_once_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_once_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_once_t)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_once_t)).__sig as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_once_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_once_t)).__opaque as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_once_t),
                       "::",
                       stringify!(__opaque)));
}
impl Clone for _opaque_pthread_once_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
               200usize,
               concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_rwlock_t)).__sig as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_rwlock_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_rwlock_t)).__opaque as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_rwlock_t),
                       "::",
                       stringify!(__opaque)));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
               24usize,
               concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const _opaque_pthread_rwlockattr_t)).__sig as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_rwlockattr_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe {
                   &(*(0 as *const _opaque_pthread_rwlockattr_t)).__opaque as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_rwlockattr_t),
                       "::",
                       stringify!(__opaque)));
}
impl Clone for _opaque_pthread_rwlockattr_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    assert_eq!(::std::mem::size_of::<_opaque_pthread_t>(),
               8192usize,
               concat!("Size of: ", stringify!(_opaque_pthread_t)));
    assert_eq!(::std::mem::align_of::<_opaque_pthread_t>(),
               8usize,
               concat!("Alignment of ", stringify!(_opaque_pthread_t)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_t)).__sig as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_t),
                       "::",
                       stringify!(__sig)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_t)).__cleanup_stack as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_t),
                       "::",
                       stringify!(__cleanup_stack)));
    assert_eq!(unsafe { &(*(0 as *const _opaque_pthread_t)).__opaque as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(_opaque_pthread_t),
                       "::",
                       stringify!(__opaque)));
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type boolean_t = ::std::os::raw::c_uint;
pub type natural_t = __darwin_natural_t;
pub type integer_t = ::std::os::raw::c_int;
pub type vm_offset_t = usize;
pub type vm_size_t = usize;
pub type mach_vm_address_t = u64;
pub type mach_vm_offset_t = u64;
pub type mach_vm_size_t = u64;
pub type vm_map_offset_t = u64;
pub type vm_map_address_t = u64;
pub type vm_map_size_t = u64;
pub type mach_port_context_t = mach_vm_address_t;
pub type mach_port_name_t = natural_t;
pub type mach_port_name_array_t = *mut mach_port_name_t;
pub type mach_port_t = __darwin_mach_port_t;
pub type mach_port_array_t = *mut mach_port_t;
pub type mach_port_right_t = natural_t;
pub type mach_port_type_t = natural_t;
pub type mach_port_type_array_t = *mut mach_port_type_t;
pub type mach_port_urefs_t = natural_t;
pub type mach_port_delta_t = integer_t;
pub type mach_port_seqno_t = natural_t;
pub type mach_port_mscount_t = natural_t;
pub type mach_port_msgcount_t = natural_t;
pub type mach_port_rights_t = natural_t;
pub type mach_port_srights_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_port_status {
    pub mps_pset: mach_port_rights_t,
    pub mps_seqno: mach_port_seqno_t,
    pub mps_mscount: mach_port_mscount_t,
    pub mps_qlimit: mach_port_msgcount_t,
    pub mps_msgcount: mach_port_msgcount_t,
    pub mps_sorights: mach_port_rights_t,
    pub mps_srights: boolean_t,
    pub mps_pdrequest: boolean_t,
    pub mps_nsrequest: boolean_t,
    pub mps_flags: natural_t,
}
#[test]
fn bindgen_test_layout_mach_port_status() {
    assert_eq!(::std::mem::size_of::<mach_port_status>(),
               40usize,
               concat!("Size of: ", stringify!(mach_port_status)));
    assert_eq!(::std::mem::align_of::<mach_port_status>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_port_status)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_pset as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_pset)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_seqno as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_seqno)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_mscount as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_mscount)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_qlimit as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_qlimit)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_msgcount as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_msgcount)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_sorights as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_sorights)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_srights as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_srights)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_pdrequest as *const _ as usize },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_pdrequest)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_nsrequest as *const _ as usize },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_nsrequest)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_status)).mps_flags as *const _ as usize },
               36usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_status),
                       "::",
                       stringify!(mps_flags)));
}
impl Clone for mach_port_status {
    fn clone(&self) -> Self {
        *self
    }
}
pub type mach_port_status_t = mach_port_status;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_port_limits {
    pub mpl_qlimit: mach_port_msgcount_t,
}
#[test]
fn bindgen_test_layout_mach_port_limits() {
    assert_eq!(::std::mem::size_of::<mach_port_limits>(),
               4usize,
               concat!("Size of: ", stringify!(mach_port_limits)));
    assert_eq!(::std::mem::align_of::<mach_port_limits>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_port_limits)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_limits)).mpl_qlimit as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_limits),
                       "::",
                       stringify!(mpl_qlimit)));
}
impl Clone for mach_port_limits {
    fn clone(&self) -> Self {
        *self
    }
}
pub type mach_port_limits_t = mach_port_limits;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_port_info_ext {
    pub mpie_status: mach_port_status_t,
    pub mpie_boost_cnt: mach_port_msgcount_t,
    pub reserved: [u32; 6usize],
}
#[test]
fn bindgen_test_layout_mach_port_info_ext() {
    assert_eq!(::std::mem::size_of::<mach_port_info_ext>(),
               68usize,
               concat!("Size of: ", stringify!(mach_port_info_ext)));
    assert_eq!(::std::mem::align_of::<mach_port_info_ext>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_port_info_ext)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_info_ext)).mpie_status as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_info_ext),
                       "::",
                       stringify!(mpie_status)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_info_ext)).mpie_boost_cnt as *const _ as usize },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_info_ext),
                       "::",
                       stringify!(mpie_boost_cnt)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_info_ext)).reserved as *const _ as usize },
               44usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_info_ext),
                       "::",
                       stringify!(reserved)));
}
impl Clone for mach_port_info_ext {
    fn clone(&self) -> Self {
        *self
    }
}
pub type mach_port_info_ext_t = mach_port_info_ext;
pub type mach_port_info_t = *mut integer_t;
pub type mach_port_flavor_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_port_qos {
    pub _bitfield_1: u32,
    pub len: natural_t,
}
#[test]
fn bindgen_test_layout_mach_port_qos() {
    assert_eq!(::std::mem::size_of::<mach_port_qos>(),
               8usize,
               concat!("Size of: ", stringify!(mach_port_qos)));
    assert_eq!(::std::mem::align_of::<mach_port_qos>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_port_qos)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_qos)).len as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_qos),
                       "::",
                       stringify!(len)));
}
impl Clone for mach_port_qos {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_port_qos {
    #[inline]
    pub fn name(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 1u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_name(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn prealloc(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 2u64 as u32;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_prealloc(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn pad1(&self) -> boolean_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4294967292u64 as u32;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_pad1(&mut self, val: boolean_t) {
        let mask = 4294967292u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(name: ::std::os::raw::c_uint,
                          prealloc: ::std::os::raw::c_uint,
                          pad1: boolean_t)
                          -> u32 {
        ({
             ({
                  ({
                       0
                   } | ((name as u32 as u32) << 0usize) & (1u64 as u32))
              } | ((prealloc as u32 as u32) << 1usize) & (2u64 as u32))
         } | ((pad1 as u32 as u32) << 2usize) & (4294967292u64 as u32))
    }
}
pub type mach_port_qos_t = mach_port_qos;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_port_options {
    pub flags: u32,
    pub mpl: mach_port_limits_t,
    pub reserved: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_mach_port_options() {
    assert_eq!(::std::mem::size_of::<mach_port_options>(),
               24usize,
               concat!("Size of: ", stringify!(mach_port_options)));
    assert_eq!(::std::mem::align_of::<mach_port_options>(),
               8usize,
               concat!("Alignment of ", stringify!(mach_port_options)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_options)).flags as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_options),
                       "::",
                       stringify!(flags)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_options)).mpl as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_options),
                       "::",
                       stringify!(mpl)));
    assert_eq!(unsafe { &(*(0 as *const mach_port_options)).reserved as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(mach_port_options),
                       "::",
                       stringify!(reserved)));
}
impl Clone for mach_port_options {
    fn clone(&self) -> Self {
        *self
    }
}
pub type mach_port_options_t = mach_port_options;
pub type mach_port_options_ptr_t = *mut mach_port_options_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum mach_port_guard_exception_codes {
    kGUARD_EXC_DESTROY = 1,
    kGUARD_EXC_MOD_REFS = 2,
    kGUARD_EXC_SET_CONTEXT = 4,
    kGUARD_EXC_UNGUARDED = 8,
    kGUARD_EXC_INCORRECT_GUARD = 16,
}
pub type kern_return_t = ::std::os::raw::c_int;
pub type mach_msg_timeout_t = natural_t;
pub type mach_msg_bits_t = ::std::os::raw::c_uint;
pub type mach_msg_size_t = natural_t;
pub type mach_msg_id_t = integer_t;
pub type mach_msg_priority_t = ::std::os::raw::c_uint;
pub type mach_msg_type_name_t = ::std::os::raw::c_uint;
pub type mach_msg_copy_options_t = ::std::os::raw::c_uint;
pub type mach_msg_descriptor_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_type_descriptor_t {
    pub pad1: natural_t,
    pub pad2: mach_msg_size_t,
    pub _bitfield_1: u32,
}
#[test]
fn bindgen_test_layout_mach_msg_type_descriptor_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_type_descriptor_t>(),
               12usize,
               concat!("Size of: ", stringify!(mach_msg_type_descriptor_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_type_descriptor_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_type_descriptor_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_type_descriptor_t)).pad1 as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_type_descriptor_t),
                       "::",
                       stringify!(pad1)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_type_descriptor_t)).pad2 as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_type_descriptor_t),
                       "::",
                       stringify!(pad2)));
}
impl Clone for mach_msg_type_descriptor_t {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_msg_type_descriptor_t {
    #[inline]
    pub fn pad3(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 16777215u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_pad3(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16777215u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4278190080u64 as u32;
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        let mask = 4278190080u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(pad3: ::std::os::raw::c_uint, type_: mach_msg_descriptor_type_t) -> u32 {
        ({
             ({
                  0
              } | ((pad3 as u32 as u32) << 0usize) & (16777215u64 as u32))
         } | ((type_ as u32 as u32) << 24usize) & (4278190080u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_port_descriptor_t {
    pub name: mach_port_t,
    pub pad1: mach_msg_size_t,
    pub _bitfield_1: [u16; 2usize],
}
#[test]
fn bindgen_test_layout_mach_msg_port_descriptor_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_port_descriptor_t>(),
               12usize,
               concat!("Size of: ", stringify!(mach_msg_port_descriptor_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_port_descriptor_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_port_descriptor_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_port_descriptor_t)).name as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_port_descriptor_t),
                       "::",
                       stringify!(name)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_port_descriptor_t)).pad1 as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_port_descriptor_t),
                       "::",
                       stringify!(pad1)));
}
impl Clone for mach_msg_port_descriptor_t {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_msg_port_descriptor_t {
    #[inline]
    pub fn pad2(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65535u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_pad2(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 65535u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 16711680u64 as u32;
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        let mask = 16711680u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4278190080u64 as u32;
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        let mask = 4278190080u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(pad2: ::std::os::raw::c_uint,
                          disposition: mach_msg_type_name_t,
                          type_: mach_msg_descriptor_type_t)
                          -> u32 {
        ({
             ({
                  ({
                       0
                   } | ((pad2 as u32 as u32) << 0usize) & (65535u64 as u32))
              } | ((disposition as u32 as u32) << 16usize) & (16711680u64 as u32))
         } | ((type_ as u32 as u32) << 24usize) & (4278190080u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_ool_descriptor32_t {
    pub address: u32,
    pub size: mach_msg_size_t,
    pub _bitfield_1: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_mach_msg_ool_descriptor32_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_ool_descriptor32_t>(),
               12usize,
               concat!("Size of: ", stringify!(mach_msg_ool_descriptor32_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_ool_descriptor32_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_ool_descriptor32_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_ool_descriptor32_t)).address as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_descriptor32_t),
                       "::",
                       stringify!(address)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_ool_descriptor32_t)).size as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_descriptor32_t),
                       "::",
                       stringify!(size)));
}
impl Clone for mach_msg_ool_descriptor32_t {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_msg_ool_descriptor32_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn pad1(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 16711680u64 as u32;
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_pad1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16711680u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4278190080u64 as u32;
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        let mask = 4278190080u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(deallocate: boolean_t,
                          copy: mach_msg_copy_options_t,
                          pad1: ::std::os::raw::c_uint,
                          type_: mach_msg_descriptor_type_t)
                          -> u32 {
        ({
             ({
                  ({
                       ({
                            0
                        } |
                        ((deallocate as u32 as u32) << 0usize) & (255u64 as u32))
                   } | ((copy as u32 as u32) << 8usize) & (65280u64 as u32))
              } | ((pad1 as u32 as u32) << 16usize) & (16711680u64 as u32))
         } | ((type_ as u32 as u32) << 24usize) & (4278190080u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_ool_descriptor64_t {
    pub address: u64,
    pub _bitfield_1: [u8; 4usize],
    pub size: mach_msg_size_t,
}
#[test]
fn bindgen_test_layout_mach_msg_ool_descriptor64_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_ool_descriptor64_t>(),
               16usize,
               concat!("Size of: ", stringify!(mach_msg_ool_descriptor64_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_ool_descriptor64_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_ool_descriptor64_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_ool_descriptor64_t)).address as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_descriptor64_t),
                       "::",
                       stringify!(address)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_ool_descriptor64_t)).size as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_descriptor64_t),
                       "::",
                       stringify!(size)));
}
impl Clone for mach_msg_ool_descriptor64_t {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_msg_ool_descriptor64_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn pad1(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 16711680u64 as u32;
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_pad1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16711680u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4278190080u64 as u32;
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        let mask = 4278190080u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(deallocate: boolean_t,
                          copy: mach_msg_copy_options_t,
                          pad1: ::std::os::raw::c_uint,
                          type_: mach_msg_descriptor_type_t)
                          -> u32 {
        ({
             ({
                  ({
                       ({
                            0
                        } |
                        ((deallocate as u32 as u32) << 0usize) & (255u64 as u32))
                   } | ((copy as u32 as u32) << 8usize) & (65280u64 as u32))
              } | ((pad1 as u32 as u32) << 16usize) & (16711680u64 as u32))
         } | ((type_ as u32 as u32) << 24usize) & (4278190080u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_ool_descriptor_t {
    pub address: *mut ::std::os::raw::c_void,
    pub _bitfield_1: [u8; 4usize],
    pub size: mach_msg_size_t,
}
#[test]
fn bindgen_test_layout_mach_msg_ool_descriptor_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_ool_descriptor_t>(),
               16usize,
               concat!("Size of: ", stringify!(mach_msg_ool_descriptor_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_ool_descriptor_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_ool_descriptor_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_ool_descriptor_t)).address as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_descriptor_t),
                       "::",
                       stringify!(address)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_ool_descriptor_t)).size as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_descriptor_t),
                       "::",
                       stringify!(size)));
}
impl Clone for mach_msg_ool_descriptor_t {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_msg_ool_descriptor_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn pad1(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 16711680u64 as u32;
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_pad1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16711680u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4278190080u64 as u32;
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        let mask = 4278190080u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(deallocate: boolean_t,
                          copy: mach_msg_copy_options_t,
                          pad1: ::std::os::raw::c_uint,
                          type_: mach_msg_descriptor_type_t)
                          -> u32 {
        ({
             ({
                  ({
                       ({
                            0
                        } |
                        ((deallocate as u32 as u32) << 0usize) & (255u64 as u32))
                   } | ((copy as u32 as u32) << 8usize) & (65280u64 as u32))
              } | ((pad1 as u32 as u32) << 16usize) & (16711680u64 as u32))
         } | ((type_ as u32 as u32) << 24usize) & (4278190080u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_ool_ports_descriptor32_t {
    pub address: u32,
    pub count: mach_msg_size_t,
    pub _bitfield_1: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_mach_msg_ool_ports_descriptor32_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_ool_ports_descriptor32_t>(),
               12usize,
               concat!("Size of: ", stringify!(mach_msg_ool_ports_descriptor32_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_ool_ports_descriptor32_t>(),
               4usize,
               concat!("Alignment of ",
                       stringify!(mach_msg_ool_ports_descriptor32_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_ool_ports_descriptor32_t)).address as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_ports_descriptor32_t),
                       "::",
                       stringify!(address)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_ool_ports_descriptor32_t)).count as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_ports_descriptor32_t),
                       "::",
                       stringify!(count)));
}
impl Clone for mach_msg_ool_ports_descriptor32_t {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_msg_ool_ports_descriptor32_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 16711680u64 as u32;
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        let mask = 16711680u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4278190080u64 as u32;
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        let mask = 4278190080u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(deallocate: boolean_t,
                          copy: mach_msg_copy_options_t,
                          disposition: mach_msg_type_name_t,
                          type_: mach_msg_descriptor_type_t)
                          -> u32 {
        ({
             ({
                  ({
                       ({
                            0
                        } |
                        ((deallocate as u32 as u32) << 0usize) & (255u64 as u32))
                   } | ((copy as u32 as u32) << 8usize) & (65280u64 as u32))
              } | ((disposition as u32 as u32) << 16usize) & (16711680u64 as u32))
         } | ((type_ as u32 as u32) << 24usize) & (4278190080u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_ool_ports_descriptor64_t {
    pub address: u64,
    pub _bitfield_1: [u8; 4usize],
    pub count: mach_msg_size_t,
}
#[test]
fn bindgen_test_layout_mach_msg_ool_ports_descriptor64_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_ool_ports_descriptor64_t>(),
               16usize,
               concat!("Size of: ", stringify!(mach_msg_ool_ports_descriptor64_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_ool_ports_descriptor64_t>(),
               4usize,
               concat!("Alignment of ",
                       stringify!(mach_msg_ool_ports_descriptor64_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_ool_ports_descriptor64_t)).address as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_ports_descriptor64_t),
                       "::",
                       stringify!(address)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_ool_ports_descriptor64_t)).count as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_ports_descriptor64_t),
                       "::",
                       stringify!(count)));
}
impl Clone for mach_msg_ool_ports_descriptor64_t {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_msg_ool_ports_descriptor64_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 16711680u64 as u32;
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        let mask = 16711680u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4278190080u64 as u32;
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        let mask = 4278190080u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(deallocate: boolean_t,
                          copy: mach_msg_copy_options_t,
                          disposition: mach_msg_type_name_t,
                          type_: mach_msg_descriptor_type_t)
                          -> u32 {
        ({
             ({
                  ({
                       ({
                            0
                        } |
                        ((deallocate as u32 as u32) << 0usize) & (255u64 as u32))
                   } | ((copy as u32 as u32) << 8usize) & (65280u64 as u32))
              } | ((disposition as u32 as u32) << 16usize) & (16711680u64 as u32))
         } | ((type_ as u32 as u32) << 24usize) & (4278190080u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_ool_ports_descriptor_t {
    pub address: *mut ::std::os::raw::c_void,
    pub _bitfield_1: [u8; 4usize],
    pub count: mach_msg_size_t,
}
#[test]
fn bindgen_test_layout_mach_msg_ool_ports_descriptor_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_ool_ports_descriptor_t>(),
               16usize,
               concat!("Size of: ", stringify!(mach_msg_ool_ports_descriptor_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_ool_ports_descriptor_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_ool_ports_descriptor_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_ool_ports_descriptor_t)).address as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_ports_descriptor_t),
                       "::",
                       stringify!(address)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_ool_ports_descriptor_t)).count as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_ool_ports_descriptor_t),
                       "::",
                       stringify!(count)));
}
impl Clone for mach_msg_ool_ports_descriptor_t {
    fn clone(&self) -> Self {
        *self
    }
}
impl mach_msg_ool_ports_descriptor_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 16711680u64 as u32;
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        let mask = 16711680u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4278190080u64 as u32;
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        let mask = 4278190080u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u32 as *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(deallocate: boolean_t,
                          copy: mach_msg_copy_options_t,
                          disposition: mach_msg_type_name_t,
                          type_: mach_msg_descriptor_type_t)
                          -> u32 {
        ({
             ({
                  ({
                       ({
                            0
                        } |
                        ((deallocate as u32 as u32) << 0usize) & (255u64 as u32))
                   } | ((copy as u32 as u32) << 8usize) & (65280u64 as u32))
              } | ((disposition as u32 as u32) << 16usize) & (16711680u64 as u32))
         } | ((type_ as u32 as u32) << 24usize) & (4278190080u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_descriptor_t {
    pub port: __BindgenUnionField<mach_msg_port_descriptor_t>,
    pub out_of_line: __BindgenUnionField<mach_msg_ool_descriptor_t>,
    pub ool_ports: __BindgenUnionField<mach_msg_ool_ports_descriptor_t>,
    pub type_: __BindgenUnionField<mach_msg_type_descriptor_t>,
    pub bindgen_union_field: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_mach_msg_descriptor_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_descriptor_t>(),
               16usize,
               concat!("Size of: ", stringify!(mach_msg_descriptor_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_descriptor_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_descriptor_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_descriptor_t)).port as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_descriptor_t),
                       "::",
                       stringify!(port)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_descriptor_t)).out_of_line as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_descriptor_t),
                       "::",
                       stringify!(out_of_line)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_descriptor_t)).ool_ports as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_descriptor_t),
                       "::",
                       stringify!(ool_ports)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_descriptor_t)).type_ as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_descriptor_t),
                       "::",
                       stringify!(type_)));
}
impl Clone for mach_msg_descriptor_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_body_t {
    pub msgh_descriptor_count: mach_msg_size_t,
}
#[test]
fn bindgen_test_layout_mach_msg_body_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_body_t>(),
               4usize,
               concat!("Size of: ", stringify!(mach_msg_body_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_body_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_body_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_body_t)).msgh_descriptor_count as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_body_t),
                       "::",
                       stringify!(msgh_descriptor_count)));
}
impl Clone for mach_msg_body_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_header_t {
    pub msgh_bits: mach_msg_bits_t,
    pub msgh_size: mach_msg_size_t,
    pub msgh_remote_port: mach_port_t,
    pub msgh_local_port: mach_port_t,
    pub msgh_voucher_port: mach_port_name_t,
    pub msgh_id: mach_msg_id_t,
}
#[test]
fn bindgen_test_layout_mach_msg_header_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_header_t>(),
               24usize,
               concat!("Size of: ", stringify!(mach_msg_header_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_header_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_header_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_header_t)).msgh_bits as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_header_t),
                       "::",
                       stringify!(msgh_bits)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_header_t)).msgh_size as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_header_t),
                       "::",
                       stringify!(msgh_size)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_header_t)).msgh_remote_port as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_header_t),
                       "::",
                       stringify!(msgh_remote_port)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_header_t)).msgh_local_port as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_header_t),
                       "::",
                       stringify!(msgh_local_port)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_header_t)).msgh_voucher_port as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_header_t),
                       "::",
                       stringify!(msgh_voucher_port)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_header_t)).msgh_id as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_header_t),
                       "::",
                       stringify!(msgh_id)));
}
impl Clone for mach_msg_header_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_base_t {
    pub header: mach_msg_header_t,
    pub body: mach_msg_body_t,
}
#[test]
fn bindgen_test_layout_mach_msg_base_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_base_t>(),
               28usize,
               concat!("Size of: ", stringify!(mach_msg_base_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_base_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_base_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_base_t)).header as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_base_t),
                       "::",
                       stringify!(header)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_base_t)).body as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_base_t),
                       "::",
                       stringify!(body)));
}
impl Clone for mach_msg_base_t {
    fn clone(&self) -> Self {
        *self
    }
}
pub type mach_msg_trailer_type_t = ::std::os::raw::c_uint;
pub type mach_msg_trailer_size_t = ::std::os::raw::c_uint;
pub type mach_msg_trailer_info_t = *mut ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
}
#[test]
fn bindgen_test_layout_mach_msg_trailer_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_trailer_t>(),
               8usize,
               concat!("Size of: ", stringify!(mach_msg_trailer_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_trailer_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_trailer_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_trailer_t)).msgh_trailer_type as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_trailer_t),
                       "::",
                       stringify!(msgh_trailer_type)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_trailer_t)).msgh_trailer_size as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_trailer_t),
                       "::",
                       stringify!(msgh_trailer_size)));
}
impl Clone for mach_msg_trailer_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_seqno_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
}
#[test]
fn bindgen_test_layout_mach_msg_seqno_trailer_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_seqno_trailer_t>(),
               12usize,
               concat!("Size of: ", stringify!(mach_msg_seqno_trailer_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_seqno_trailer_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_seqno_trailer_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_seqno_trailer_t)).msgh_trailer_type as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_seqno_trailer_t),
                       "::",
                       stringify!(msgh_trailer_type)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_seqno_trailer_t)).msgh_trailer_size as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_seqno_trailer_t),
                       "::",
                       stringify!(msgh_trailer_size)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_seqno_trailer_t)).msgh_seqno as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_seqno_trailer_t),
                       "::",
                       stringify!(msgh_seqno)));
}
impl Clone for mach_msg_seqno_trailer_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct security_token_t {
    pub val: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout_security_token_t() {
    assert_eq!(::std::mem::size_of::<security_token_t>(),
               8usize,
               concat!("Size of: ", stringify!(security_token_t)));
    assert_eq!(::std::mem::align_of::<security_token_t>(),
               4usize,
               concat!("Alignment of ", stringify!(security_token_t)));
    assert_eq!(unsafe { &(*(0 as *const security_token_t)).val as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(security_token_t),
                       "::",
                       stringify!(val)));
}
impl Clone for security_token_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_security_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
    pub msgh_sender: security_token_t,
}
#[test]
fn bindgen_test_layout_mach_msg_security_trailer_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_security_trailer_t>(),
               20usize,
               concat!("Size of: ", stringify!(mach_msg_security_trailer_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_security_trailer_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_security_trailer_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_security_trailer_t)).msgh_trailer_type as *const _ as
                   usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_security_trailer_t),
                       "::",
                       stringify!(msgh_trailer_type)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_security_trailer_t)).msgh_trailer_size as *const _ as
                   usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_security_trailer_t),
                       "::",
                       stringify!(msgh_trailer_size)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_security_trailer_t)).msgh_seqno as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_security_trailer_t),
                       "::",
                       stringify!(msgh_seqno)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_security_trailer_t)).msgh_sender as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_security_trailer_t),
                       "::",
                       stringify!(msgh_sender)));
}
impl Clone for mach_msg_security_trailer_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct audit_token_t {
    pub val: [::std::os::raw::c_uint; 8usize],
}
#[test]
fn bindgen_test_layout_audit_token_t() {
    assert_eq!(::std::mem::size_of::<audit_token_t>(),
               32usize,
               concat!("Size of: ", stringify!(audit_token_t)));
    assert_eq!(::std::mem::align_of::<audit_token_t>(),
               4usize,
               concat!("Alignment of ", stringify!(audit_token_t)));
    assert_eq!(unsafe { &(*(0 as *const audit_token_t)).val as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(audit_token_t),
                       "::",
                       stringify!(val)));
}
impl Clone for audit_token_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_audit_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
    pub msgh_sender: security_token_t,
    pub msgh_audit: audit_token_t,
}
#[test]
fn bindgen_test_layout_mach_msg_audit_trailer_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_audit_trailer_t>(),
               52usize,
               concat!("Size of: ", stringify!(mach_msg_audit_trailer_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_audit_trailer_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_audit_trailer_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_audit_trailer_t)).msgh_trailer_type as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_audit_trailer_t),
                       "::",
                       stringify!(msgh_trailer_type)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_audit_trailer_t)).msgh_trailer_size as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_audit_trailer_t),
                       "::",
                       stringify!(msgh_trailer_size)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_audit_trailer_t)).msgh_seqno as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_audit_trailer_t),
                       "::",
                       stringify!(msgh_seqno)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_audit_trailer_t)).msgh_sender as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_audit_trailer_t),
                       "::",
                       stringify!(msgh_sender)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_audit_trailer_t)).msgh_audit as *const _ as usize
               },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_audit_trailer_t),
                       "::",
                       stringify!(msgh_audit)));
}
impl Clone for mach_msg_audit_trailer_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_context_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
    pub msgh_sender: security_token_t,
    pub msgh_audit: audit_token_t,
    pub msgh_context: mach_port_context_t,
}
#[test]
fn bindgen_test_layout_mach_msg_context_trailer_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_context_trailer_t>(),
               60usize,
               concat!("Size of: ", stringify!(mach_msg_context_trailer_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_context_trailer_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_context_trailer_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_context_trailer_t)).msgh_trailer_type as *const _ as
                   usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_context_trailer_t),
                       "::",
                       stringify!(msgh_trailer_type)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_context_trailer_t)).msgh_trailer_size as *const _ as
                   usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_context_trailer_t),
                       "::",
                       stringify!(msgh_trailer_size)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_context_trailer_t)).msgh_seqno as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_context_trailer_t),
                       "::",
                       stringify!(msgh_seqno)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_context_trailer_t)).msgh_sender as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_context_trailer_t),
                       "::",
                       stringify!(msgh_sender)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_context_trailer_t)).msgh_audit as *const _ as usize
               },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_context_trailer_t),
                       "::",
                       stringify!(msgh_audit)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_context_trailer_t)).msgh_context as *const _ as usize
               },
               52usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_context_trailer_t),
                       "::",
                       stringify!(msgh_context)));
}
impl Clone for mach_msg_context_trailer_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct msg_labels_t {
    pub sender: mach_port_name_t,
}
#[test]
fn bindgen_test_layout_msg_labels_t() {
    assert_eq!(::std::mem::size_of::<msg_labels_t>(),
               4usize,
               concat!("Size of: ", stringify!(msg_labels_t)));
    assert_eq!(::std::mem::align_of::<msg_labels_t>(),
               4usize,
               concat!("Alignment of ", stringify!(msg_labels_t)));
    assert_eq!(unsafe { &(*(0 as *const msg_labels_t)).sender as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(msg_labels_t),
                       "::",
                       stringify!(sender)));
}
impl Clone for msg_labels_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_mac_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
    pub msgh_sender: security_token_t,
    pub msgh_audit: audit_token_t,
    pub msgh_context: mach_port_context_t,
    pub msgh_ad: ::std::os::raw::c_int,
    pub msgh_labels: msg_labels_t,
}
#[test]
fn bindgen_test_layout_mach_msg_mac_trailer_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_mac_trailer_t>(),
               68usize,
               concat!("Size of: ", stringify!(mach_msg_mac_trailer_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_mac_trailer_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_mac_trailer_t)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_mac_trailer_t)).msgh_trailer_type as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_mac_trailer_t),
                       "::",
                       stringify!(msgh_trailer_type)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_mac_trailer_t)).msgh_trailer_size as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_mac_trailer_t),
                       "::",
                       stringify!(msgh_trailer_size)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_mac_trailer_t)).msgh_seqno as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_mac_trailer_t),
                       "::",
                       stringify!(msgh_seqno)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_mac_trailer_t)).msgh_sender as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_mac_trailer_t),
                       "::",
                       stringify!(msgh_sender)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_mac_trailer_t)).msgh_audit as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_mac_trailer_t),
                       "::",
                       stringify!(msgh_audit)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_mac_trailer_t)).msgh_context as *const _ as usize
               },
               52usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_mac_trailer_t),
                       "::",
                       stringify!(msgh_context)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_mac_trailer_t)).msgh_ad as *const _ as usize },
               60usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_mac_trailer_t),
                       "::",
                       stringify!(msgh_ad)));
    assert_eq!(unsafe {
                   &(*(0 as *const mach_msg_mac_trailer_t)).msgh_labels as *const _ as usize
               },
               64usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_mac_trailer_t),
                       "::",
                       stringify!(msgh_labels)));
}
impl Clone for mach_msg_mac_trailer_t {
    fn clone(&self) -> Self {
        *self
    }
}
pub type mach_msg_max_trailer_t = mach_msg_mac_trailer_t;
pub type mach_msg_format_0_trailer_t = mach_msg_security_trailer_t;
extern "C" {
    #[link_name = "KERNEL_SECURITY_TOKEN"]
    pub static mut KERNEL_SECURITY_TOKEN: security_token_t;
}
extern "C" {
    #[link_name = "KERNEL_AUDIT_TOKEN"]
    pub static mut KERNEL_AUDIT_TOKEN: audit_token_t;
}
pub type mach_msg_options_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_empty_send_t {
    pub header: mach_msg_header_t,
}
#[test]
fn bindgen_test_layout_mach_msg_empty_send_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_empty_send_t>(),
               24usize,
               concat!("Size of: ", stringify!(mach_msg_empty_send_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_empty_send_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_empty_send_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_empty_send_t)).header as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_empty_send_t),
                       "::",
                       stringify!(header)));
}
impl Clone for mach_msg_empty_send_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_empty_rcv_t {
    pub header: mach_msg_header_t,
    pub trailer: mach_msg_trailer_t,
}
#[test]
fn bindgen_test_layout_mach_msg_empty_rcv_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_empty_rcv_t>(),
               32usize,
               concat!("Size of: ", stringify!(mach_msg_empty_rcv_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_empty_rcv_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_empty_rcv_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_empty_rcv_t)).header as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_empty_rcv_t),
                       "::",
                       stringify!(header)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_empty_rcv_t)).trailer as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_empty_rcv_t),
                       "::",
                       stringify!(trailer)));
}
impl Clone for mach_msg_empty_rcv_t {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mach_msg_empty_t {
    pub send: __BindgenUnionField<mach_msg_empty_send_t>,
    pub rcv: __BindgenUnionField<mach_msg_empty_rcv_t>,
    pub bindgen_union_field: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_mach_msg_empty_t() {
    assert_eq!(::std::mem::size_of::<mach_msg_empty_t>(),
               32usize,
               concat!("Size of: ", stringify!(mach_msg_empty_t)));
    assert_eq!(::std::mem::align_of::<mach_msg_empty_t>(),
               4usize,
               concat!("Alignment of ", stringify!(mach_msg_empty_t)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_empty_t)).send as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_empty_t),
                       "::",
                       stringify!(send)));
    assert_eq!(unsafe { &(*(0 as *const mach_msg_empty_t)).rcv as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(mach_msg_empty_t),
                       "::",
                       stringify!(rcv)));
}
impl Clone for mach_msg_empty_t {
    fn clone(&self) -> Self {
        *self
    }
}
pub type mach_msg_type_size_t = natural_t;
pub type mach_msg_type_number_t = natural_t;
pub type mach_msg_option_t = integer_t;
pub type mach_msg_return_t = kern_return_t;
extern "C" {
    pub fn mach_msg_overwrite(msg: *mut mach_msg_header_t,
                              option: mach_msg_option_t,
                              send_size: mach_msg_size_t,
                              rcv_size: mach_msg_size_t,
                              rcv_name: mach_port_name_t,
                              timeout: mach_msg_timeout_t,
                              notify: mach_port_name_t,
                              rcv_msg: *mut mach_msg_header_t,
                              rcv_limit: mach_msg_size_t)
                              -> mach_msg_return_t;
}
extern "C" {
    pub fn mach_msg(msg: *mut mach_msg_header_t,
                    option: mach_msg_option_t,
                    send_size: mach_msg_size_t,
                    rcv_size: mach_msg_size_t,
                    rcv_name: mach_port_name_t,
                    timeout: mach_msg_timeout_t,
                    notify: mach_port_name_t)
                    -> mach_msg_return_t;
}
extern "C" {
    pub fn mach_voucher_deallocate(voucher: mach_port_name_t) -> kern_return_t;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct vm_statistics {
    pub free_count: natural_t,
    pub active_count: natural_t,
    pub inactive_count: natural_t,
    pub wire_count: natural_t,
    pub zero_fill_count: natural_t,
    pub reactivations: natural_t,
    pub pageins: natural_t,
    pub pageouts: natural_t,
    pub faults: natural_t,
    pub cow_faults: natural_t,
    pub lookups: natural_t,
    pub hits: natural_t,
    pub purgeable_count: natural_t,
    pub purges: natural_t,
    pub speculative_count: natural_t,
}
#[test]
fn bindgen_test_layout_vm_statistics() {
    assert_eq!(::std::mem::size_of::<vm_statistics>(),
               60usize,
               concat!("Size of: ", stringify!(vm_statistics)));
    assert_eq!(::std::mem::align_of::<vm_statistics>(),
               4usize,
               concat!("Alignment of ", stringify!(vm_statistics)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).free_count as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(free_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).active_count as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(active_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).inactive_count as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(inactive_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).wire_count as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(wire_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).zero_fill_count as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(zero_fill_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).reactivations as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(reactivations)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).pageins as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(pageins)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).pageouts as *const _ as usize },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(pageouts)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).faults as *const _ as usize },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(faults)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).cow_faults as *const _ as usize },
               36usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(cow_faults)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).lookups as *const _ as usize },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(lookups)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).hits as *const _ as usize },
               44usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(hits)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).purgeable_count as *const _ as usize },
               48usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(purgeable_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).purges as *const _ as usize },
               52usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(purges)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics)).speculative_count as *const _ as usize },
               56usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics),
                       "::",
                       stringify!(speculative_count)));
}
impl Clone for vm_statistics {
    fn clone(&self) -> Self {
        *self
    }
}
pub type vm_statistics_t = *mut vm_statistics;
pub type vm_statistics_data_t = vm_statistics;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct vm_statistics64 {
    pub free_count: natural_t,
    pub active_count: natural_t,
    pub inactive_count: natural_t,
    pub wire_count: natural_t,
    pub zero_fill_count: u64,
    pub reactivations: u64,
    pub pageins: u64,
    pub pageouts: u64,
    pub faults: u64,
    pub cow_faults: u64,
    pub lookups: u64,
    pub hits: u64,
    pub purges: u64,
    pub purgeable_count: natural_t,
    pub speculative_count: natural_t,
    pub decompressions: u64,
    pub compressions: u64,
    pub swapins: u64,
    pub swapouts: u64,
    pub compressor_page_count: natural_t,
    pub throttled_count: natural_t,
    pub external_page_count: natural_t,
    pub internal_page_count: natural_t,
    pub total_uncompressed_pages_in_compressor: u64,
}
#[test]
fn bindgen_test_layout_vm_statistics64() {
    assert_eq!(::std::mem::size_of::<vm_statistics64>(),
               152usize,
               concat!("Size of: ", stringify!(vm_statistics64)));
    assert_eq!(::std::mem::align_of::<vm_statistics64>(),
               8usize,
               concat!("Alignment of ", stringify!(vm_statistics64)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).free_count as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(free_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).active_count as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(active_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).inactive_count as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(inactive_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).wire_count as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(wire_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).zero_fill_count as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(zero_fill_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).reactivations as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(reactivations)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).pageins as *const _ as usize },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(pageins)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).pageouts as *const _ as usize },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(pageouts)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).faults as *const _ as usize },
               48usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(faults)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).cow_faults as *const _ as usize },
               56usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(cow_faults)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).lookups as *const _ as usize },
               64usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(lookups)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).hits as *const _ as usize },
               72usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(hits)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).purges as *const _ as usize },
               80usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(purges)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).purgeable_count as *const _ as usize },
               88usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(purgeable_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).speculative_count as *const _ as usize },
               92usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(speculative_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).decompressions as *const _ as usize },
               96usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(decompressions)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).compressions as *const _ as usize },
               104usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(compressions)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).swapins as *const _ as usize },
               112usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(swapins)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).swapouts as *const _ as usize },
               120usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(swapouts)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_statistics64)).compressor_page_count as *const _ as usize
               },
               128usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(compressor_page_count)));
    assert_eq!(unsafe { &(*(0 as *const vm_statistics64)).throttled_count as *const _ as usize },
               132usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(throttled_count)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_statistics64)).external_page_count as *const _ as usize
               },
               136usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(external_page_count)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_statistics64)).internal_page_count as *const _ as usize
               },
               140usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(internal_page_count)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_statistics64)).total_uncompressed_pages_in_compressor as
                   *const _ as usize
               },
               144usize,
               concat!("Alignment of field: ",
                       stringify!(vm_statistics64),
                       "::",
                       stringify!(total_uncompressed_pages_in_compressor)));
}
impl Clone for vm_statistics64 {
    fn clone(&self) -> Self {
        *self
    }
}
pub type vm_statistics64_t = *mut vm_statistics64;
pub type vm_statistics64_data_t = vm_statistics64;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct vm_extmod_statistics {
    pub task_for_pid_count: i64,
    pub task_for_pid_caller_count: i64,
    pub thread_creation_count: i64,
    pub thread_creation_caller_count: i64,
    pub thread_set_state_count: i64,
    pub thread_set_state_caller_count: i64,
}
#[test]
fn bindgen_test_layout_vm_extmod_statistics() {
    assert_eq!(::std::mem::size_of::<vm_extmod_statistics>(),
               48usize,
               concat!("Size of: ", stringify!(vm_extmod_statistics)));
    assert_eq!(::std::mem::align_of::<vm_extmod_statistics>(),
               8usize,
               concat!("Alignment of ", stringify!(vm_extmod_statistics)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_extmod_statistics)).task_for_pid_count as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(vm_extmod_statistics),
                       "::",
                       stringify!(task_for_pid_count)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_extmod_statistics)).task_for_pid_caller_count as *const _ as
                   usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(vm_extmod_statistics),
                       "::",
                       stringify!(task_for_pid_caller_count)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_extmod_statistics)).thread_creation_count as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(vm_extmod_statistics),
                       "::",
                       stringify!(thread_creation_count)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_extmod_statistics)).thread_creation_caller_count as
                   *const _ as usize
               },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(vm_extmod_statistics),
                       "::",
                       stringify!(thread_creation_caller_count)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_extmod_statistics)).thread_set_state_count as *const _ as
                   usize
               },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(vm_extmod_statistics),
                       "::",
                       stringify!(thread_set_state_count)));
    assert_eq!(unsafe {
                   &(*(0 as *const vm_extmod_statistics)).thread_set_state_caller_count as
                   *const _ as usize
               },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(vm_extmod_statistics),
                       "::",
                       stringify!(thread_set_state_caller_count)));
}
impl Clone for vm_extmod_statistics {
    fn clone(&self) -> Self {
        *self
    }
}
pub type vm_extmod_statistics_t = *mut vm_extmod_statistics;
pub type vm_extmod_statistics_data_t = vm_extmod_statistics;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct vm_purgeable_stat {
    pub count: u64,
    pub size: u64,
}
#[test]
fn bindgen_test_layout_vm_purgeable_stat() {
    assert_eq!(::std::mem::size_of::<vm_purgeable_stat>(),
               16usize,
               concat!("Size of: ", stringify!(vm_purgeable_stat)));
    assert_eq!(::std::mem::align_of::<vm_purgeable_stat>(),
               8usize,
               concat!("Alignment of ", stringify!(vm_purgeable_stat)));
    assert_eq!(unsafe { &(*(0 as *const vm_purgeable_stat)).count as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(vm_purgeable_stat),
                       "::",
                       stringify!(count)));
    assert_eq!(unsafe { &(*(0 as *const vm_purgeable_stat)).size as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(vm_purgeable_stat),
                       "::",
                       stringify!(size)));
}
impl Clone for vm_purgeable_stat {
    fn clone(&self) -> Self {
        *self
    }
}
pub type vm_purgeable_stat_t = vm_purgeable_stat;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct vm_purgeable_info {
    pub fifo_data: [vm_purgeable_stat_t; 8usize],
    pub obsolete_data: vm_purgeable_stat_t,
    pub lifo_data: [vm_purgeable_stat_t; 8usize],
}
#[test]
fn bindgen_test_layout_vm_purgeable_info() {
    assert_eq!(::std::mem::size_of::<vm_purgeable_info>(),
               272usize,
               concat!("Size of: ", stringify!(vm_purgeable_info)));
    assert_eq!(::std::mem::align_of::<vm_purgeable_info>(),
               8usize,
               concat!("Alignment of ", stringify!(vm_purgeable_info)));
    assert_eq!(unsafe { &(*(0 as *const vm_purgeable_info)).fifo_data as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(vm_purgeable_info),
                       "::",
                       stringify!(fifo_data)));
    assert_eq!(unsafe { &(*(0 as *const vm_purgeable_info)).obsolete_data as *const _ as usize },
               128usize,
               concat!("Alignment of field: ",
                       stringify!(vm_purgeable_info),
                       "::",
                       stringify!(obsolete_data)));
    assert_eq!(unsafe { &(*(0 as *const vm_purgeable_info)).lifo_data as *const _ as usize },
               144usize,
               concat!("Alignment of field: ",
                       stringify!(vm_purgeable_info),
                       "::",
                       stringify!(lifo_data)));
}
impl Clone for vm_purgeable_info {
    fn clone(&self) -> Self {
        *self
    }
}
pub type vm_purgeable_info_t = *mut vm_purgeable_info;
pub type cpu_type_t = integer_t;
pub type cpu_subtype_t = integer_t;
pub type cpu_threadtype_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct time_value {
    pub seconds: integer_t,
    pub microseconds: integer_t,
}
#[test]
fn bindgen_test_layout_time_value() {
    assert_eq!(::std::mem::size_of::<time_value>(),
               8usize,
               concat!("Size of: ", stringify!(time_value)));
    assert_eq!(::std::mem::align_of::<time_value>(),
               4usize,
               concat!("Alignment of ", stringify!(time_value)));
    assert_eq!(unsafe { &(*(0 as *const time_value)).seconds as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(time_value),
                       "::",
                       stringify!(seconds)));
    assert_eq!(unsafe { &(*(0 as *const time_value)).microseconds as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(time_value),
                       "::",
                       stringify!(microseconds)));
}
impl Clone for time_value {
    fn clone(&self) -> Self {
        *self
    }
}
pub type time_value_t = time_value;
pub type host_info_t = *mut integer_t;
pub type host_info64_t = *mut integer_t;
pub type host_info_data_t = [integer_t; 1024usize];
pub type kernel_version_t = [::std::os::raw::c_char; 512usize];
pub type kernel_boot_info_t = [::std::os::raw::c_char; 4096usize];
pub type host_flavor_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct host_can_has_debugger_info {
    pub can_has_debugger: boolean_t,
}
#[test]
fn bindgen_test_layout_host_can_has_debugger_info() {
    assert_eq!(::std::mem::size_of::<host_can_has_debugger_info>(),
               4usize,
               concat!("Size of: ", stringify!(host_can_has_debugger_info)));
    assert_eq!(::std::mem::align_of::<host_can_has_debugger_info>(),
               4usize,
               concat!("Alignment of ", stringify!(host_can_has_debugger_info)));
    assert_eq!(unsafe {
                   &(*(0 as *const host_can_has_debugger_info)).can_has_debugger as *const _ as
                   usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(host_can_has_debugger_info),
                       "::",
                       stringify!(can_has_debugger)));
}
impl Clone for host_can_has_debugger_info {
    fn clone(&self) -> Self {
        *self
    }
}
pub type host_can_has_debugger_info_data_t = host_can_has_debugger_info;
pub type host_can_has_debugger_info_t = *mut host_can_has_debugger_info;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct host_basic_info {
    pub max_cpus: integer_t,
    pub avail_cpus: integer_t,
    pub memory_size: natural_t,
    pub cpu_type: cpu_type_t,
    pub cpu_subtype: cpu_subtype_t,
    pub cpu_threadtype: cpu_threadtype_t,
    pub physical_cpu: integer_t,
    pub physical_cpu_max: integer_t,
    pub logical_cpu: integer_t,
    pub logical_cpu_max: integer_t,
    pub max_mem: u64,
}
#[test]
fn bindgen_test_layout_host_basic_info() {
    assert_eq!(::std::mem::size_of::<host_basic_info>(),
               48usize,
               concat!("Size of: ", stringify!(host_basic_info)));
    assert_eq!(::std::mem::align_of::<host_basic_info>(),
               4usize,
               concat!("Alignment of ", stringify!(host_basic_info)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).max_cpus as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(max_cpus)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).avail_cpus as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(avail_cpus)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).memory_size as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(memory_size)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).cpu_type as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(cpu_type)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).cpu_subtype as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(cpu_subtype)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).cpu_threadtype as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(cpu_threadtype)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).physical_cpu as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(physical_cpu)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).physical_cpu_max as *const _ as usize },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(physical_cpu_max)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).logical_cpu as *const _ as usize },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(logical_cpu)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).logical_cpu_max as *const _ as usize },
               36usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(logical_cpu_max)));
    assert_eq!(unsafe { &(*(0 as *const host_basic_info)).max_mem as *const _ as usize },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(host_basic_info),
                       "::",
                       stringify!(max_mem)));
}
impl Clone for host_basic_info {
    fn clone(&self) -> Self {
        *self
    }
}
pub type host_basic_info_data_t = host_basic_info;
pub type host_basic_info_t = *mut host_basic_info;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct host_sched_info {
    pub min_timeout: integer_t,
    pub min_quantum: integer_t,
}
#[test]
fn bindgen_test_layout_host_sched_info() {
    assert_eq!(::std::mem::size_of::<host_sched_info>(),
               8usize,
               concat!("Size of: ", stringify!(host_sched_info)));
    assert_eq!(::std::mem::align_of::<host_sched_info>(),
               4usize,
               concat!("Alignment of ", stringify!(host_sched_info)));
    assert_eq!(unsafe { &(*(0 as *const host_sched_info)).min_timeout as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(host_sched_info),
                       "::",
                       stringify!(min_timeout)));
    assert_eq!(unsafe { &(*(0 as *const host_sched_info)).min_quantum as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(host_sched_info),
                       "::",
                       stringify!(min_quantum)));
}
impl Clone for host_sched_info {
    fn clone(&self) -> Self {
        *self
    }
}
pub type host_sched_info_data_t = host_sched_info;
pub type host_sched_info_t = *mut host_sched_info;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct kernel_resource_sizes {
    pub task: natural_t,
    pub thread: natural_t,
    pub port: natural_t,
    pub memory_region: natural_t,
    pub memory_object: natural_t,
}
#[test]
fn bindgen_test_layout_kernel_resource_sizes() {
    assert_eq!(::std::mem::size_of::<kernel_resource_sizes>(),
               20usize,
               concat!("Size of: ", stringify!(kernel_resource_sizes)));
    assert_eq!(::std::mem::align_of::<kernel_resource_sizes>(),
               4usize,
               concat!("Alignment of ", stringify!(kernel_resource_sizes)));
    assert_eq!(unsafe { &(*(0 as *const kernel_resource_sizes)).task as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(kernel_resource_sizes),
                       "::",
                       stringify!(task)));
    assert_eq!(unsafe { &(*(0 as *const kernel_resource_sizes)).thread as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(kernel_resource_sizes),
                       "::",
                       stringify!(thread)));
    assert_eq!(unsafe { &(*(0 as *const kernel_resource_sizes)).port as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(kernel_resource_sizes),
                       "::",
                       stringify!(port)));
    assert_eq!(unsafe {
                   &(*(0 as *const kernel_resource_sizes)).memory_region as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(kernel_resource_sizes),
                       "::",
                       stringify!(memory_region)));
    assert_eq!(unsafe {
                   &(*(0 as *const kernel_resource_sizes)).memory_object as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(kernel_resource_sizes),
                       "::",
                       stringify!(memory_object)));
}
impl Clone for kernel_resource_sizes {
    fn clone(&self) -> Self {
        *self
    }
}
pub type kernel_resource_sizes_data_t = kernel_resource_sizes;
pub type kernel_resource_sizes_t = *mut kernel_resource_sizes;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct host_priority_info {
    pub kernel_priority: integer_t,
    pub system_priority: integer_t,
    pub server_priority: integer_t,
    pub user_priority: integer_t,
    pub depress_priority: integer_t,
    pub idle_priority: integer_t,
    pub minimum_priority: integer_t,
    pub maximum_priority: integer_t,
}
#[test]
fn bindgen_test_layout_host_priority_info() {
    assert_eq!(::std::mem::size_of::<host_priority_info>(),
               32usize,
               concat!("Size of: ", stringify!(host_priority_info)));
    assert_eq!(::std::mem::align_of::<host_priority_info>(),
               4usize,
               concat!("Alignment of ", stringify!(host_priority_info)));
    assert_eq!(unsafe {
                   &(*(0 as *const host_priority_info)).kernel_priority as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(host_priority_info),
                       "::",
                       stringify!(kernel_priority)));
    assert_eq!(unsafe {
                   &(*(0 as *const host_priority_info)).system_priority as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(host_priority_info),
                       "::",
                       stringify!(system_priority)));
    assert_eq!(unsafe {
                   &(*(0 as *const host_priority_info)).server_priority as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(host_priority_info),
                       "::",
                       stringify!(server_priority)));
    assert_eq!(unsafe { &(*(0 as *const host_priority_info)).user_priority as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(host_priority_info),
                       "::",
                       stringify!(user_priority)));
    assert_eq!(unsafe {
                   &(*(0 as *const host_priority_info)).depress_priority as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(host_priority_info),
                       "::",
                       stringify!(depress_priority)));
    assert_eq!(unsafe { &(*(0 as *const host_priority_info)).idle_priority as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(host_priority_info),
                       "::",
                       stringify!(idle_priority)));
    assert_eq!(unsafe {
                   &(*(0 as *const host_priority_info)).minimum_priority as *const _ as usize
               },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(host_priority_info),
                       "::",
                       stringify!(minimum_priority)));
    assert_eq!(unsafe {
                   &(*(0 as *const host_priority_info)).maximum_priority as *const _ as usize
               },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(host_priority_info),
                       "::",
                       stringify!(maximum_priority)));
}
impl Clone for host_priority_info {
    fn clone(&self) -> Self {
        *self
    }
}
pub type host_priority_info_data_t = host_priority_info;
pub type host_priority_info_t = *mut host_priority_info;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct host_load_info {
    pub avenrun: [integer_t; 3usize],
    pub mach_factor: [integer_t; 3usize],
}
#[test]
fn bindgen_test_layout_host_load_info() {
    assert_eq!(::std::mem::size_of::<host_load_info>(),
               24usize,
               concat!("Size of: ", stringify!(host_load_info)));
    assert_eq!(::std::mem::align_of::<host_load_info>(),
               4usize,
               concat!("Alignment of ", stringify!(host_load_info)));
    assert_eq!(unsafe { &(*(0 as *const host_load_info)).avenrun as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(host_load_info),
                       "::",
                       stringify!(avenrun)));
    assert_eq!(unsafe { &(*(0 as *const host_load_info)).mach_factor as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(host_load_info),
                       "::",
                       stringify!(mach_factor)));
}
impl Clone for host_load_info {
    fn clone(&self) -> Self {
        *self
    }
}
pub type host_load_info_data_t = host_load_info;
pub type host_load_info_t = *mut host_load_info;
pub type host_purgable_info_data_t = vm_purgeable_info;
pub type host_purgable_info_t = *mut vm_purgeable_info;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct host_cpu_load_info {
    pub cpu_ticks: [natural_t; 4usize],
}
#[test]
fn bindgen_test_layout_host_cpu_load_info() {
    assert_eq!(::std::mem::size_of::<host_cpu_load_info>(),
               16usize,
               concat!("Size of: ", stringify!(host_cpu_load_info)));
    assert_eq!(::std::mem::align_of::<host_cpu_load_info>(),
               4usize,
               concat!("Alignment of ", stringify!(host_cpu_load_info)));
    assert_eq!(unsafe { &(*(0 as *const host_cpu_load_info)).cpu_ticks as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(host_cpu_load_info),
                       "::",
                       stringify!(cpu_ticks)));
}
impl Clone for host_cpu_load_info {
    fn clone(&self) -> Self {
        *self
    }
}
pub type host_cpu_load_info_data_t = host_cpu_load_info;
pub type host_cpu_load_info_t = *mut host_cpu_load_info;
pub type vm_prot_t = ::std::os::raw::c_int;
pub type vm_sync_t = ::std::os::raw::c_uint;
pub type pointer_t = vm_offset_t;
pub type vm_address_t = vm_offset_t;
pub type addr64_t = u64;
pub type reg64_t = u32;
pub type ppnum_t = u32;
pub type vm_map_t = mach_port_t;
pub type vm_object_offset_t = u64;
pub type vm_object_size_t = u64;
pub type upl_t = mach_port_t;
pub type vm_named_entry_t = mach_port_t;
pub type memory_object_offset_t = ::std::os::raw::c_ulonglong;
pub type memory_object_size_t = ::std::os::raw::c_ulonglong;
pub type memory_object_cluster_size_t = natural_t;
pub type memory_object_fault_info_t = *mut natural_t;
pub type vm_object_id_t = ::std::os::raw::c_ulonglong;
pub type memory_object_t = mach_port_t;
pub type memory_object_control_t = mach_port_t;
pub type memory_object_array_t = *mut memory_object_t;
pub type memory_object_name_t = mach_port_t;
pub type memory_object_default_t = mach_port_t;
pub type memory_object_copy_strategy_t = ::std::os::raw::c_int;
pub type memory_object_return_t = ::std::os::raw::c_int;
pub type memory_object_info_t = *mut ::std::os::raw::c_int;
pub type memory_object_flavor_t = ::std::os::raw::c_int;
pub type memory_object_info_data_t = [::std::os::raw::c_int; 1024usize];
#[repr(C)]
#[derive(Debug, Copy)]
pub struct memory_object_perf_info {
    pub cluster_size: memory_object_cluster_size_t,
    pub may_cache: boolean_t,
}
#[test]
fn bindgen_test_layout_memory_object_perf_info() {
    assert_eq!(::std::mem::size_of::<memory_object_perf_info>(),
               8usize,
               concat!("Size of: ", stringify!(memory_object_perf_info)));
    assert_eq!(::std::mem::align_of::<memory_object_perf_info>(),
               4usize,
               concat!("Alignment of ", stringify!(memory_object_perf_info)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_perf_info)).cluster_size as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_perf_info),
                       "::",
                       stringify!(cluster_size)));
    assert_eq!(unsafe { &(*(0 as *const memory_object_perf_info)).may_cache as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_perf_info),
                       "::",
                       stringify!(may_cache)));
}
impl Clone for memory_object_perf_info {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct memory_object_attr_info {
    pub copy_strategy: memory_object_copy_strategy_t,
    pub cluster_size: memory_object_cluster_size_t,
    pub may_cache_object: boolean_t,
    pub temporary: boolean_t,
}
#[test]
fn bindgen_test_layout_memory_object_attr_info() {
    assert_eq!(::std::mem::size_of::<memory_object_attr_info>(),
               16usize,
               concat!("Size of: ", stringify!(memory_object_attr_info)));
    assert_eq!(::std::mem::align_of::<memory_object_attr_info>(),
               4usize,
               concat!("Alignment of ", stringify!(memory_object_attr_info)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_attr_info)).copy_strategy as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_attr_info),
                       "::",
                       stringify!(copy_strategy)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_attr_info)).cluster_size as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_attr_info),
                       "::",
                       stringify!(cluster_size)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_attr_info)).may_cache_object as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_attr_info),
                       "::",
                       stringify!(may_cache_object)));
    assert_eq!(unsafe { &(*(0 as *const memory_object_attr_info)).temporary as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_attr_info),
                       "::",
                       stringify!(temporary)));
}
impl Clone for memory_object_attr_info {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct memory_object_behave_info {
    pub copy_strategy: memory_object_copy_strategy_t,
    pub temporary: boolean_t,
    pub invalidate: boolean_t,
    pub silent_overwrite: boolean_t,
    pub advisory_pageout: boolean_t,
}
#[test]
fn bindgen_test_layout_memory_object_behave_info() {
    assert_eq!(::std::mem::size_of::<memory_object_behave_info>(),
               20usize,
               concat!("Size of: ", stringify!(memory_object_behave_info)));
    assert_eq!(::std::mem::align_of::<memory_object_behave_info>(),
               4usize,
               concat!("Alignment of ", stringify!(memory_object_behave_info)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_behave_info)).copy_strategy as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_behave_info),
                       "::",
                       stringify!(copy_strategy)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_behave_info)).temporary as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_behave_info),
                       "::",
                       stringify!(temporary)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_behave_info)).invalidate as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_behave_info),
                       "::",
                       stringify!(invalidate)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_behave_info)).silent_overwrite as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_behave_info),
                       "::",
                       stringify!(silent_overwrite)));
    assert_eq!(unsafe {
                   &(*(0 as *const memory_object_behave_info)).advisory_pageout as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(memory_object_behave_info),
                       "::",
                       stringify!(advisory_pageout)));
}
impl Clone for memory_object_behave_info {
    fn clone(&self) -> Self {
        *self
    }
}
pub type memory_object_behave_info_t = *mut memory_object_behave_info;
pub type memory_object_behave_info_data_t = memory_object_behave_info;
pub type memory_object_perf_info_t = *mut memory_object_perf_info;
pub type memory_object_perf_info_data_t = memory_object_perf_info;
pub type memory_object_attr_info_t = *mut memory_object_attr_info;
pub type memory_object_attr_info_data_t = memory_object_attr_info;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_i386_thread_state {
    pub __eax: ::std::os::raw::c_uint,
    pub __ebx: ::std::os::raw::c_uint,
    pub __ecx: ::std::os::raw::c_uint,
    pub __edx: ::std::os::raw::c_uint,
    pub __edi: ::std::os::raw::c_uint,
    pub __esi: ::std::os::raw::c_uint,
    pub __ebp: ::std::os::raw::c_uint,
    pub __esp: ::std::os::raw::c_uint,
    pub __ss: ::std::os::raw::c_uint,
    pub __eflags: ::std::os::raw::c_uint,
    pub __eip: ::std::os::raw::c_uint,
    pub __cs: ::std::os::raw::c_uint,
    pub __ds: ::std::os::raw::c_uint,
    pub __es: ::std::os::raw::c_uint,
    pub __fs: ::std::os::raw::c_uint,
    pub __gs: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___darwin_i386_thread_state() {
    assert_eq!(::std::mem::size_of::<__darwin_i386_thread_state>(),
               64usize,
               concat!("Size of: ", stringify!(__darwin_i386_thread_state)));
    assert_eq!(::std::mem::align_of::<__darwin_i386_thread_state>(),
               4usize,
               concat!("Alignment of ", stringify!(__darwin_i386_thread_state)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__eax as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__eax)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__ebx as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__ebx)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__ecx as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__ecx)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__edx as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__edx)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__edi as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__edi)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__esi as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__esi)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__ebp as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__ebp)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__esp as *const _ as usize },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__esp)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__ss as *const _ as usize },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__ss)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_thread_state)).__eflags as *const _ as usize
               },
               36usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__eflags)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__eip as *const _ as usize },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__eip)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__cs as *const _ as usize },
               44usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__cs)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__ds as *const _ as usize },
               48usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__ds)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__es as *const _ as usize },
               52usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__es)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__fs as *const _ as usize },
               56usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__fs)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_thread_state)).__gs as *const _ as usize },
               60usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_thread_state),
                       "::",
                       stringify!(__gs)));
}
impl Clone for __darwin_i386_thread_state {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_fp_control {
    pub _bitfield_1: [u8; 2usize],
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout___darwin_fp_control() {
    assert_eq!(::std::mem::size_of::<__darwin_fp_control>(),
               2usize,
               concat!("Size of: ", stringify!(__darwin_fp_control)));
    assert_eq!(::std::mem::align_of::<__darwin_fp_control>(),
               2usize,
               concat!("Alignment of ", stringify!(__darwin_fp_control)));
}
impl Clone for __darwin_fp_control {
    fn clone(&self) -> Self {
        *self
    }
}
impl __darwin_fp_control {
    #[inline]
    pub fn __invalid(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 1u64 as u16;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___invalid(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 1u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __denorm(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 2u64 as u16;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___denorm(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 2u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __zdiv(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 4u64 as u16;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___zdiv(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 4u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __ovrfl(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 8u64 as u16;
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___ovrfl(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 8u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __undfl(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 16u64 as u16;
        let val = (unit_field_val & mask) >> 4usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___undfl(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 16u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 4usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __precis(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 32u64 as u16;
        let val = (unit_field_val & mask) >> 5usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___precis(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 32u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 5usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __pc(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 768u64 as u16;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___pc(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 768u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __rc(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 3072u64 as u16;
        let val = (unit_field_val & mask) >> 10usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___rc(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 3072u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 10usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(__invalid: ::std::os::raw::c_ushort,
                          __denorm: ::std::os::raw::c_ushort,
                          __zdiv: ::std::os::raw::c_ushort,
                          __ovrfl: ::std::os::raw::c_ushort,
                          __undfl: ::std::os::raw::c_ushort,
                          __precis: ::std::os::raw::c_ushort,
                          __pc: ::std::os::raw::c_ushort,
                          __rc: ::std::os::raw::c_ushort)
                          -> u16 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({
                                      ({
                                           ({
                                                0
                                            } |
                                            ((__invalid as u16 as u16) << 0usize) & (1u64 as u16))
                                       } |
                                       ((__denorm as u16 as u16) << 1usize) & (2u64 as u16))
                                  } |
                                  ((__zdiv as u16 as u16) << 2usize) & (4u64 as u16))
                             } |
                             ((__ovrfl as u16 as u16) << 3usize) & (8u64 as u16))
                        } |
                        ((__undfl as u16 as u16) << 4usize) & (16u64 as u16))
                   } | ((__precis as u16 as u16) << 5usize) & (32u64 as u16))
              } | ((__pc as u16 as u16) << 8usize) & (768u64 as u16))
         } | ((__rc as u16 as u16) << 10usize) & (3072u64 as u16))
    }
}
pub type __darwin_fp_control_t = __darwin_fp_control;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_fp_status {
    pub _bitfield_1: [u8; 2usize],
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout___darwin_fp_status() {
    assert_eq!(::std::mem::size_of::<__darwin_fp_status>(),
               2usize,
               concat!("Size of: ", stringify!(__darwin_fp_status)));
    assert_eq!(::std::mem::align_of::<__darwin_fp_status>(),
               2usize,
               concat!("Alignment of ", stringify!(__darwin_fp_status)));
}
impl Clone for __darwin_fp_status {
    fn clone(&self) -> Self {
        *self
    }
}
impl __darwin_fp_status {
    #[inline]
    pub fn __invalid(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 1u64 as u16;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___invalid(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 1u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __denorm(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 2u64 as u16;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___denorm(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 2u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __zdiv(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 4u64 as u16;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___zdiv(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 4u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __ovrfl(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 8u64 as u16;
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___ovrfl(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 8u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __undfl(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 16u64 as u16;
        let val = (unit_field_val & mask) >> 4usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___undfl(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 16u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 4usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __precis(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 32u64 as u16;
        let val = (unit_field_val & mask) >> 5usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___precis(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 32u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 5usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __stkflt(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 64u64 as u16;
        let val = (unit_field_val & mask) >> 6usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___stkflt(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 64u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 6usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __errsumm(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 128u64 as u16;
        let val = (unit_field_val & mask) >> 7usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___errsumm(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 128u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 7usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __c0(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 256u64 as u16;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___c0(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 256u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __c1(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 512u64 as u16;
        let val = (unit_field_val & mask) >> 9usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___c1(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 512u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 9usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __c2(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 1024u64 as u16;
        let val = (unit_field_val & mask) >> 10usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___c2(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 1024u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 10usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __tos(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 14336u64 as u16;
        let val = (unit_field_val & mask) >> 11usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___tos(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 14336u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 11usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __c3(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 16384u64 as u16;
        let val = (unit_field_val & mask) >> 14usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___c3(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 16384u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 14usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn __busy(&self) -> ::std::os::raw::c_ushort {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 32768u64 as u16;
        let val = (unit_field_val & mask) >> 15usize;
        unsafe { ::std::mem::transmute(val as u16) }
    }
    #[inline]
    pub fn set___busy(&mut self, val: ::std::os::raw::c_ushort) {
        let mask = 32768u64 as u16;
        let val = val as u16 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as *const u8,
                                            &mut unit_field_val as *mut u16 as *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 15usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as *const u8,
                                            &mut self._bitfield_1 as *mut _ as *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(__invalid: ::std::os::raw::c_ushort,
                          __denorm: ::std::os::raw::c_ushort,
                          __zdiv: ::std::os::raw::c_ushort,
                          __ovrfl: ::std::os::raw::c_ushort,
                          __undfl: ::std::os::raw::c_ushort,
                          __precis: ::std::os::raw::c_ushort,
                          __stkflt: ::std::os::raw::c_ushort,
                          __errsumm: ::std::os::raw::c_ushort,
                          __c0: ::std::os::raw::c_ushort,
                          __c1: ::std::os::raw::c_ushort,
                          __c2: ::std::os::raw::c_ushort,
                          __tos: ::std::os::raw::c_ushort,
                          __c3: ::std::os::raw::c_ushort,
                          __busy: ::std::os::raw::c_ushort)
                          -> u16 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({
                                      ({
                                           ({
                                                ({
                                                     ({
                                                          ({
                                                               ({
                                                                    ({
                                                                         ({
                                                                              0
                                                                          } |
                                                                          ((__invalid as u16 as
                                                                            u16) <<
                                                                           0usize) &
                                                                          (1u64 as u16))
                                                                     } |
                                                                     ((__denorm as u16 as u16) <<
                                                                      1usize) &
                                                                     (2u64 as u16))
                                                                } |
                                                                ((__zdiv as u16 as u16) << 2usize) &
                                                                (4u64 as u16))
                                                           } |
                                                           ((__ovrfl as u16 as u16) << 3usize) &
                                                           (8u64 as u16))
                                                      } |
                                                      ((__undfl as u16 as u16) << 4usize) &
                                                      (16u64 as u16))
                                                 } |
                                                 ((__precis as u16 as u16) << 5usize) &
                                                 (32u64 as u16))
                                            } |
                                            ((__stkflt as u16 as u16) << 6usize) & (64u64 as u16))
                                       } |
                                       ((__errsumm as u16 as u16) << 7usize) & (128u64 as u16))
                                  } |
                                  ((__c0 as u16 as u16) << 8usize) & (256u64 as u16))
                             } |
                             ((__c1 as u16 as u16) << 9usize) & (512u64 as u16))
                        } |
                        ((__c2 as u16 as u16) << 10usize) & (1024u64 as u16))
                   } | ((__tos as u16 as u16) << 11usize) & (14336u64 as u16))
              } | ((__c3 as u16 as u16) << 14usize) & (16384u64 as u16))
         } | ((__busy as u16 as u16) << 15usize) & (32768u64 as u16))
    }
}
pub type __darwin_fp_status_t = __darwin_fp_status;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_mmst_reg {
    pub __mmst_reg: [::std::os::raw::c_char; 10usize],
    pub __mmst_rsrv: [::std::os::raw::c_char; 6usize],
}
#[test]
fn bindgen_test_layout___darwin_mmst_reg() {
    assert_eq!(::std::mem::size_of::<__darwin_mmst_reg>(),
               16usize,
               concat!("Size of: ", stringify!(__darwin_mmst_reg)));
    assert_eq!(::std::mem::align_of::<__darwin_mmst_reg>(),
               1usize,
               concat!("Alignment of ", stringify!(__darwin_mmst_reg)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_mmst_reg)).__mmst_reg as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_mmst_reg),
                       "::",
                       stringify!(__mmst_reg)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_mmst_reg)).__mmst_rsrv as *const _ as usize },
               10usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_mmst_reg),
                       "::",
                       stringify!(__mmst_rsrv)));
}
impl Clone for __darwin_mmst_reg {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_xmm_reg {
    pub __xmm_reg: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout___darwin_xmm_reg() {
    assert_eq!(::std::mem::size_of::<__darwin_xmm_reg>(),
               16usize,
               concat!("Size of: ", stringify!(__darwin_xmm_reg)));
    assert_eq!(::std::mem::align_of::<__darwin_xmm_reg>(),
               1usize,
               concat!("Alignment of ", stringify!(__darwin_xmm_reg)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_xmm_reg)).__xmm_reg as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_xmm_reg),
                       "::",
                       stringify!(__xmm_reg)));
}
impl Clone for __darwin_xmm_reg {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_ymm_reg {
    pub __ymm_reg: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout___darwin_ymm_reg() {
    assert_eq!(::std::mem::size_of::<__darwin_ymm_reg>(),
               32usize,
               concat!("Size of: ", stringify!(__darwin_ymm_reg)));
    assert_eq!(::std::mem::align_of::<__darwin_ymm_reg>(),
               1usize,
               concat!("Alignment of ", stringify!(__darwin_ymm_reg)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_ymm_reg)).__ymm_reg as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_ymm_reg),
                       "::",
                       stringify!(__ymm_reg)));
}
impl Clone for __darwin_ymm_reg {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
pub struct __darwin_zmm_reg {
    pub __zmm_reg: [::std::os::raw::c_char; 64usize],
}
#[test]
fn bindgen_test_layout___darwin_zmm_reg() {
    assert_eq!(::std::mem::size_of::<__darwin_zmm_reg>(),
               64usize,
               concat!("Size of: ", stringify!(__darwin_zmm_reg)));
    assert_eq!(::std::mem::align_of::<__darwin_zmm_reg>(),
               1usize,
               concat!("Alignment of ", stringify!(__darwin_zmm_reg)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_zmm_reg)).__zmm_reg as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_zmm_reg),
                       "::",
                       stringify!(__zmm_reg)));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_opmask_reg {
    pub __opmask_reg: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout___darwin_opmask_reg() {
    assert_eq!(::std::mem::size_of::<__darwin_opmask_reg>(),
               8usize,
               concat!("Size of: ", stringify!(__darwin_opmask_reg)));
    assert_eq!(::std::mem::align_of::<__darwin_opmask_reg>(),
               1usize,
               concat!("Alignment of ", stringify!(__darwin_opmask_reg)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_opmask_reg)).__opmask_reg as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_opmask_reg),
                       "::",
                       stringify!(__opmask_reg)));
}
impl Clone for __darwin_opmask_reg {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
pub struct __darwin_i386_float_state {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 224usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___darwin_i386_float_state() {
    assert_eq!(::std::mem::size_of::<__darwin_i386_float_state>(),
               524usize,
               concat!("Size of: ", stringify!(__darwin_i386_float_state)));
    assert_eq!(::std::mem::align_of::<__darwin_i386_float_state>(),
               4usize,
               concat!("Alignment of ", stringify!(__darwin_i386_float_state)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_reserved as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_reserved)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_fcw as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_fcw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_fsw as *const _ as usize
               },
               10usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_fsw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_ftw as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_ftw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_rsrv1 as *const _ as usize
               },
               13usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_rsrv1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_fop as *const _ as usize
               },
               14usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_fop)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_ip as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_ip)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_cs as *const _ as usize
               },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_cs)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_rsrv2 as *const _ as usize
               },
               22usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_rsrv2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_dp as *const _ as usize
               },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_dp)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_ds as *const _ as usize
               },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_ds)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_rsrv3 as *const _ as usize
               },
               30usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_rsrv3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_mxcsr as *const _ as usize
               },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_mxcsr)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_mxcsrmask as *const _ as usize
               },
               36usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_mxcsrmask)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_stmm0 as *const _ as usize
               },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_stmm0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_stmm1 as *const _ as usize
               },
               56usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_stmm1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_stmm2 as *const _ as usize
               },
               72usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_stmm2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_stmm3 as *const _ as usize
               },
               88usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_stmm3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_stmm4 as *const _ as usize
               },
               104usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_stmm4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_stmm5 as *const _ as usize
               },
               120usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_stmm5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_stmm6 as *const _ as usize
               },
               136usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_stmm6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_stmm7 as *const _ as usize
               },
               152usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_stmm7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_xmm0 as *const _ as usize
               },
               168usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_xmm0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_xmm1 as *const _ as usize
               },
               184usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_xmm1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_xmm2 as *const _ as usize
               },
               200usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_xmm2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_xmm3 as *const _ as usize
               },
               216usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_xmm3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_xmm4 as *const _ as usize
               },
               232usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_xmm4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_xmm5 as *const _ as usize
               },
               248usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_xmm5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_xmm6 as *const _ as usize
               },
               264usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_xmm6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_xmm7 as *const _ as usize
               },
               280usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_xmm7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_rsrv4 as *const _ as usize
               },
               296usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_rsrv4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_float_state)).__fpu_reserved1 as *const _ as usize
               },
               520usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_float_state),
                       "::",
                       stringify!(__fpu_reserved1)));
}
#[repr(C)]
pub struct __darwin_i386_avx_state {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 224usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
    pub __avx_reserved1: [::std::os::raw::c_char; 64usize],
    pub __fpu_ymmh0: __darwin_xmm_reg,
    pub __fpu_ymmh1: __darwin_xmm_reg,
    pub __fpu_ymmh2: __darwin_xmm_reg,
    pub __fpu_ymmh3: __darwin_xmm_reg,
    pub __fpu_ymmh4: __darwin_xmm_reg,
    pub __fpu_ymmh5: __darwin_xmm_reg,
    pub __fpu_ymmh6: __darwin_xmm_reg,
    pub __fpu_ymmh7: __darwin_xmm_reg,
}
#[test]
fn bindgen_test_layout___darwin_i386_avx_state() {
    assert_eq!(::std::mem::size_of::<__darwin_i386_avx_state>(),
               716usize,
               concat!("Size of: ", stringify!(__darwin_i386_avx_state)));
    assert_eq!(::std::mem::align_of::<__darwin_i386_avx_state>(),
               4usize,
               concat!("Alignment of ", stringify!(__darwin_i386_avx_state)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_reserved as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_reserved)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_avx_state)).__fpu_fcw as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_fcw)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_avx_state)).__fpu_fsw as *const _ as usize },
               10usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_fsw)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_avx_state)).__fpu_ftw as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ftw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_rsrv1 as *const _ as usize
               },
               13usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_rsrv1)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_avx_state)).__fpu_fop as *const _ as usize },
               14usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_fop)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_avx_state)).__fpu_ip as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ip)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_avx_state)).__fpu_cs as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_cs)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_rsrv2 as *const _ as usize
               },
               22usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_rsrv2)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_avx_state)).__fpu_dp as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_dp)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_i386_avx_state)).__fpu_ds as *const _ as usize },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ds)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_rsrv3 as *const _ as usize
               },
               30usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_rsrv3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_mxcsr as *const _ as usize
               },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_mxcsr)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_mxcsrmask as *const _ as usize
               },
               36usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_mxcsrmask)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_stmm0 as *const _ as usize
               },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_stmm0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_stmm1 as *const _ as usize
               },
               56usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_stmm1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_stmm2 as *const _ as usize
               },
               72usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_stmm2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_stmm3 as *const _ as usize
               },
               88usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_stmm3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_stmm4 as *const _ as usize
               },
               104usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_stmm4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_stmm5 as *const _ as usize
               },
               120usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_stmm5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_stmm6 as *const _ as usize
               },
               136usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_stmm6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_stmm7 as *const _ as usize
               },
               152usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_stmm7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_xmm0 as *const _ as usize
               },
               168usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_xmm0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_xmm1 as *const _ as usize
               },
               184usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_xmm1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_xmm2 as *const _ as usize
               },
               200usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_xmm2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_xmm3 as *const _ as usize
               },
               216usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_xmm3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_xmm4 as *const _ as usize
               },
               232usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_xmm4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_xmm5 as *const _ as usize
               },
               248usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_xmm5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_xmm6 as *const _ as usize
               },
               264usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_xmm6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_xmm7 as *const _ as usize
               },
               280usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_xmm7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_rsrv4 as *const _ as usize
               },
               296usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_rsrv4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_reserved1 as *const _ as usize
               },
               520usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_reserved1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__avx_reserved1 as *const _ as usize
               },
               524usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__avx_reserved1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_ymmh0 as *const _ as usize
               },
               588usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ymmh0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_ymmh1 as *const _ as usize
               },
               604usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ymmh1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_ymmh2 as *const _ as usize
               },
               620usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ymmh2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_ymmh3 as *const _ as usize
               },
               636usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ymmh3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_ymmh4 as *const _ as usize
               },
               652usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ymmh4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_ymmh5 as *const _ as usize
               },
               668usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ymmh5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_ymmh6 as *const _ as usize
               },
               684usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ymmh6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx_state)).__fpu_ymmh7 as *const _ as usize
               },
               700usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx_state),
                       "::",
                       stringify!(__fpu_ymmh7)));
}
#[repr(C)]
pub struct __darwin_i386_avx512_state {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 224usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
    pub __avx_reserved1: [::std::os::raw::c_char; 64usize],
    pub __fpu_ymmh0: __darwin_xmm_reg,
    pub __fpu_ymmh1: __darwin_xmm_reg,
    pub __fpu_ymmh2: __darwin_xmm_reg,
    pub __fpu_ymmh3: __darwin_xmm_reg,
    pub __fpu_ymmh4: __darwin_xmm_reg,
    pub __fpu_ymmh5: __darwin_xmm_reg,
    pub __fpu_ymmh6: __darwin_xmm_reg,
    pub __fpu_ymmh7: __darwin_xmm_reg,
    pub __fpu_k0: __darwin_opmask_reg,
    pub __fpu_k1: __darwin_opmask_reg,
    pub __fpu_k2: __darwin_opmask_reg,
    pub __fpu_k3: __darwin_opmask_reg,
    pub __fpu_k4: __darwin_opmask_reg,
    pub __fpu_k5: __darwin_opmask_reg,
    pub __fpu_k6: __darwin_opmask_reg,
    pub __fpu_k7: __darwin_opmask_reg,
    pub __fpu_zmmh0: __darwin_ymm_reg,
    pub __fpu_zmmh1: __darwin_ymm_reg,
    pub __fpu_zmmh2: __darwin_ymm_reg,
    pub __fpu_zmmh3: __darwin_ymm_reg,
    pub __fpu_zmmh4: __darwin_ymm_reg,
    pub __fpu_zmmh5: __darwin_ymm_reg,
    pub __fpu_zmmh6: __darwin_ymm_reg,
    pub __fpu_zmmh7: __darwin_ymm_reg,
}
#[test]
fn bindgen_test_layout___darwin_i386_avx512_state() {
    assert_eq!(::std::mem::size_of::<__darwin_i386_avx512_state>(),
               1036usize,
               concat!("Size of: ", stringify!(__darwin_i386_avx512_state)));
    assert_eq!(::std::mem::align_of::<__darwin_i386_avx512_state>(),
               4usize,
               concat!("Alignment of ", stringify!(__darwin_i386_avx512_state)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_reserved as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_reserved)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_fcw as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_fcw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_fsw as *const _ as usize
               },
               10usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_fsw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ftw as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ftw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_rsrv1 as *const _ as usize
               },
               13usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_rsrv1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_fop as *const _ as usize
               },
               14usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_fop)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ip as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ip)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_cs as *const _ as usize
               },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_cs)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_rsrv2 as *const _ as usize
               },
               22usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_rsrv2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_dp as *const _ as usize
               },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_dp)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ds as *const _ as usize
               },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ds)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_rsrv3 as *const _ as usize
               },
               30usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_rsrv3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_mxcsr as *const _ as usize
               },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_mxcsr)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_mxcsrmask as *const _ as usize
               },
               36usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_mxcsrmask)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_stmm0 as *const _ as usize
               },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_stmm0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_stmm1 as *const _ as usize
               },
               56usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_stmm1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_stmm2 as *const _ as usize
               },
               72usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_stmm2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_stmm3 as *const _ as usize
               },
               88usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_stmm3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_stmm4 as *const _ as usize
               },
               104usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_stmm4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_stmm5 as *const _ as usize
               },
               120usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_stmm5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_stmm6 as *const _ as usize
               },
               136usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_stmm6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_stmm7 as *const _ as usize
               },
               152usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_stmm7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_xmm0 as *const _ as usize
               },
               168usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_xmm0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_xmm1 as *const _ as usize
               },
               184usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_xmm1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_xmm2 as *const _ as usize
               },
               200usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_xmm2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_xmm3 as *const _ as usize
               },
               216usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_xmm3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_xmm4 as *const _ as usize
               },
               232usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_xmm4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_xmm5 as *const _ as usize
               },
               248usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_xmm5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_xmm6 as *const _ as usize
               },
               264usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_xmm6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_xmm7 as *const _ as usize
               },
               280usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_xmm7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_rsrv4 as *const _ as usize
               },
               296usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_rsrv4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_reserved1 as *const _ as usize
               },
               520usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_reserved1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__avx_reserved1 as *const _ as usize
               },
               524usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__avx_reserved1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ymmh0 as *const _ as usize
               },
               588usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ymmh0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ymmh1 as *const _ as usize
               },
               604usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ymmh1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ymmh2 as *const _ as usize
               },
               620usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ymmh2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ymmh3 as *const _ as usize
               },
               636usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ymmh3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ymmh4 as *const _ as usize
               },
               652usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ymmh4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ymmh5 as *const _ as usize
               },
               668usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ymmh5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ymmh6 as *const _ as usize
               },
               684usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ymmh6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_ymmh7 as *const _ as usize
               },
               700usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_ymmh7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_k0 as *const _ as usize
               },
               716usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_k0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_k1 as *const _ as usize
               },
               724usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_k1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_k2 as *const _ as usize
               },
               732usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_k2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_k3 as *const _ as usize
               },
               740usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_k3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_k4 as *const _ as usize
               },
               748usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_k4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_k5 as *const _ as usize
               },
               756usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_k5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_k6 as *const _ as usize
               },
               764usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_k6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_k7 as *const _ as usize
               },
               772usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_k7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_zmmh0 as *const _ as usize
               },
               780usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_zmmh0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_zmmh1 as *const _ as usize
               },
               812usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_zmmh1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_zmmh2 as *const _ as usize
               },
               844usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_zmmh2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_zmmh3 as *const _ as usize
               },
               876usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_zmmh3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_zmmh4 as *const _ as usize
               },
               908usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_zmmh4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_zmmh5 as *const _ as usize
               },
               940usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_zmmh5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_zmmh6 as *const _ as usize
               },
               972usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_zmmh6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_avx512_state)).__fpu_zmmh7 as *const _ as usize
               },
               1004usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_avx512_state),
                       "::",
                       stringify!(__fpu_zmmh7)));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_i386_exception_state {
    pub __trapno: __uint16_t,
    pub __cpu: __uint16_t,
    pub __err: __uint32_t,
    pub __faultvaddr: __uint32_t,
}
#[test]
fn bindgen_test_layout___darwin_i386_exception_state() {
    assert_eq!(::std::mem::size_of::<__darwin_i386_exception_state>(),
               12usize,
               concat!("Size of: ", stringify!(__darwin_i386_exception_state)));
    assert_eq!(::std::mem::align_of::<__darwin_i386_exception_state>(),
               4usize,
               concat!("Alignment of ", stringify!(__darwin_i386_exception_state)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_exception_state)).__trapno as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_exception_state),
                       "::",
                       stringify!(__trapno)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_exception_state)).__cpu as *const _ as usize
               },
               2usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_exception_state),
                       "::",
                       stringify!(__cpu)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_exception_state)).__err as *const _ as usize
               },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_exception_state),
                       "::",
                       stringify!(__err)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_i386_exception_state)).__faultvaddr as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_i386_exception_state),
                       "::",
                       stringify!(__faultvaddr)));
}
impl Clone for __darwin_i386_exception_state {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_x86_debug_state32 {
    pub __dr0: ::std::os::raw::c_uint,
    pub __dr1: ::std::os::raw::c_uint,
    pub __dr2: ::std::os::raw::c_uint,
    pub __dr3: ::std::os::raw::c_uint,
    pub __dr4: ::std::os::raw::c_uint,
    pub __dr5: ::std::os::raw::c_uint,
    pub __dr6: ::std::os::raw::c_uint,
    pub __dr7: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___darwin_x86_debug_state32() {
    assert_eq!(::std::mem::size_of::<__darwin_x86_debug_state32>(),
               32usize,
               concat!("Size of: ", stringify!(__darwin_x86_debug_state32)));
    assert_eq!(::std::mem::align_of::<__darwin_x86_debug_state32>(),
               4usize,
               concat!("Alignment of ", stringify!(__darwin_x86_debug_state32)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_debug_state32)).__dr0 as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_debug_state32),
                       "::",
                       stringify!(__dr0)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_debug_state32)).__dr1 as *const _ as usize },
               4usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_debug_state32),
                       "::",
                       stringify!(__dr1)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_debug_state32)).__dr2 as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_debug_state32),
                       "::",
                       stringify!(__dr2)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_debug_state32)).__dr3 as *const _ as usize },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_debug_state32),
                       "::",
                       stringify!(__dr3)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_debug_state32)).__dr4 as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_debug_state32),
                       "::",
                       stringify!(__dr4)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_debug_state32)).__dr5 as *const _ as usize },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_debug_state32),
                       "::",
                       stringify!(__dr5)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_debug_state32)).__dr6 as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_debug_state32),
                       "::",
                       stringify!(__dr6)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_debug_state32)).__dr7 as *const _ as usize },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_debug_state32),
                       "::",
                       stringify!(__dr7)));
}
impl Clone for __darwin_x86_debug_state32 {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __darwin_x86_thread_state64 {
    pub __rax: __uint64_t,
    pub __rbx: __uint64_t,
    pub __rcx: __uint64_t,
    pub __rdx: __uint64_t,
    pub __rdi: __uint64_t,
    pub __rsi: __uint64_t,
    pub __rbp: __uint64_t,
    pub __rsp: __uint64_t,
    pub __r8: __uint64_t,
    pub __r9: __uint64_t,
    pub __r10: __uint64_t,
    pub __r11: __uint64_t,
    pub __r12: __uint64_t,
    pub __r13: __uint64_t,
    pub __r14: __uint64_t,
    pub __r15: __uint64_t,
    pub __rip: __uint64_t,
    pub __rflags: __uint64_t,
    pub __cs: __uint64_t,
    pub __fs: __uint64_t,
    pub __gs: __uint64_t,
}
#[test]
fn bindgen_test_layout___darwin_x86_thread_state64() {
    assert_eq!(::std::mem::size_of::<__darwin_x86_thread_state64>(),
               168usize,
               concat!("Size of: ", stringify!(__darwin_x86_thread_state64)));
    assert_eq!(::std::mem::align_of::<__darwin_x86_thread_state64>(),
               8usize,
               concat!("Alignment of ", stringify!(__darwin_x86_thread_state64)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rax as *const _ as usize },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rax)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rbx as *const _ as usize },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rbx)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rcx as *const _ as usize },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rcx)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rdx as *const _ as usize },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rdx)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rdi as *const _ as usize },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rdi)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rsi as *const _ as usize },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rsi)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rbp as *const _ as usize },
               48usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rbp)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rsp as *const _ as usize },
               56usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rsp)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__r8 as *const _ as usize },
               64usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__r8)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__r9 as *const _ as usize },
               72usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__r9)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__r10 as *const _ as usize },
               80usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__r10)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__r11 as *const _ as usize },
               88usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__r11)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__r12 as *const _ as usize },
               96usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__r12)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__r13 as *const _ as usize },
               104usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__r13)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__r14 as *const _ as usize },
               112usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__r14)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__r15 as *const _ as usize },
               120usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__r15)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__rip as *const _ as usize },
               128usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rip)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_thread_state64)).__rflags as *const _ as usize
               },
               136usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__rflags)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__cs as *const _ as usize },
               144usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__cs)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__fs as *const _ as usize },
               152usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__fs)));
    assert_eq!(unsafe { &(*(0 as *const __darwin_x86_thread_state64)).__gs as *const _ as usize },
               160usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_thread_state64),
                       "::",
                       stringify!(__gs)));
}
impl Clone for __darwin_x86_thread_state64 {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
pub struct __darwin_x86_float_state64 {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_xmm8: __darwin_xmm_reg,
    pub __fpu_xmm9: __darwin_xmm_reg,
    pub __fpu_xmm10: __darwin_xmm_reg,
    pub __fpu_xmm11: __darwin_xmm_reg,
    pub __fpu_xmm12: __darwin_xmm_reg,
    pub __fpu_xmm13: __darwin_xmm_reg,
    pub __fpu_xmm14: __darwin_xmm_reg,
    pub __fpu_xmm15: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 96usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___darwin_x86_float_state64() {
    assert_eq!(::std::mem::size_of::<__darwin_x86_float_state64>(),
               524usize,
               concat!("Size of: ", stringify!(__darwin_x86_float_state64)));
    assert_eq!(::std::mem::align_of::<__darwin_x86_float_state64>(),
               4usize,
               concat!("Alignment of ", stringify!(__darwin_x86_float_state64)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_reserved as *const _ as usize
               },
               0usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_reserved)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_fcw as *const _ as usize
               },
               8usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_fcw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_fsw as *const _ as usize
               },
               10usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_fsw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_ftw as *const _ as usize
               },
               12usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_ftw)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_rsrv1 as *const _ as usize
               },
               13usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_rsrv1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_fop as *const _ as usize
               },
               14usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_fop)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_ip as *const _ as usize
               },
               16usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_ip)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_cs as *const _ as usize
               },
               20usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_cs)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_rsrv2 as *const _ as usize
               },
               22usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_rsrv2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_dp as *const _ as usize
               },
               24usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_dp)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_ds as *const _ as usize
               },
               28usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_ds)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_rsrv3 as *const _ as usize
               },
               30usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_rsrv3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_mxcsr as *const _ as usize
               },
               32usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_mxcsr)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_mxcsrmask as *const _ as usize
               },
               36usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_mxcsrmask)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_stmm0 as *const _ as usize
               },
               40usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_stmm0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_stmm1 as *const _ as usize
               },
               56usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_stmm1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_stmm2 as *const _ as usize
               },
               72usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_stmm2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_stmm3 as *const _ as usize
               },
               88usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_stmm3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_stmm4 as *const _ as usize
               },
               104usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_stmm4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_stmm5 as *const _ as usize
               },
               120usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_stmm5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_stmm6 as *const _ as usize
               },
               136usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_stmm6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_stmm7 as *const _ as usize
               },
               152usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_stmm7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm0 as *const _ as usize
               },
               168usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm0)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm1 as *const _ as usize
               },
               184usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm1)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm2 as *const _ as usize
               },
               200usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm2)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm3 as *const _ as usize
               },
               216usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm3)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm4 as *const _ as usize
               },
               232usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm5 as *const _ as usize
               },
               248usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm5)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm6 as *const _ as usize
               },
               264usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm6)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm7 as *const _ as usize
               },
               280usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm7)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm8 as *const _ as usize
               },
               296usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm8)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm9 as *const _ as usize
               },
               312usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm9)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm10 as *const _ as usize
               },
               328usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm10)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm11 as *const _ as usize
               },
               344usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm11)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm12 as *const _ as usize
               },
               360usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm12)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm13 as *const _ as usize
               },
               376usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm13)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm14 as *const _ as usize
               },
               392usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm14)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_xmm15 as *const _ as usize
               },
               408usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_xmm15)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_rsrv4 as *const _ as usize
               },
               424usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_rsrv4)));
    assert_eq!(unsafe {
                   &(*(0 as *const __darwin_x86_float_state64)).__fpu_reserved1 as *const _ as usize
               },
               520usize,
               concat!("Alignment of field: ",
                       stringify!(__darwin_x86_float_state64),
                       "::",
                       stringify!(__fpu_reserved1)));
}
#[repr(C)]
pub struct __darwin_x86_avx_state64 {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_xmm8: __darwin_xmm_reg,
    pub __fpu_xmm9: __darwin_xmm_reg,
    pub __fpu_xmm10: __darwin_xmm_reg,
    pub __fpu_xmm11: __darwin_xmm_reg,
    pub __fpu_xmm12: __darwin_xmm_reg,
    pub __fpu_xmm13: __darwin_xmm_reg,
    pub __fpu_xmm14: __darwin_xmm_reg,
    pub __fpu_xmm15: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 96usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
    pub __avx_reserved1: [::std::os::raw::c_char; 64usize],
    pub __fpu_ymmh0: __darwin_xmm_reg,
    pub __fpu_ymmh1: __darwin_xmm_reg,
    pub __fpu_ymmh2: __darwin_xmm_reg,
    pub __fpu_ymmh3: __darwin_xmm_reg,
    pub __fpu_ymmh4: __darwin_xmm_reg,
    pub __fpu_ymmh5: __darwin_xmm_reg,
    pub __fpu_ymmh6: __darwin_xmm_reg,
    pub __fpu_ymmh7: __darwin_xmm_reg,
    pub __fpu_ymmh8: __darwin_xmm_reg,
    pub __fpu_ymmh9: __darwin_xmm_reg,
    pub __fpu_ymmh10: __darwin_xmm_reg,
